In [4]:
import pandas as pd
import numpy as np

In [5]:
#处理缺失值
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isna

<bound method Series.isna of 0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object>

In [8]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
string_data.dropna

<bound method Series.dropna of 0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object>

In [11]:
string_data.dropna()

0     aardvark
1    artichoke
3      avocado
dtype: object

In [12]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [13]:
string_data1 = string_data.dropna()

In [14]:
string_data1

0     aardvark
1    artichoke
3      avocado
dtype: object

In [15]:
string_data2 = string_data.fillna(0)

In [16]:
string_data2

0     aardvark
1    artichoke
2            0
3      avocado
dtype: object

In [17]:
from numpy import nan as NA

In [18]:
data = pd.Series([1,NA,3.5,NA,7])

In [19]:
data.dropna

<bound method Series.dropna of 0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64>

In [20]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [21]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [22]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
#删除包含缺失值的行
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [24]:
#hou=all时，将删除一行的所有值均为NA的行
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data[4]=na

NameError: name 'na' is not defined

In [26]:
data[4]=NA

In [27]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [28]:
data.dropna[axis = 1,how='all']

SyntaxError: invalid syntax (<ipython-input-28-a988ed2bf443>, line 1)

In [29]:
data.dropna(axis = 1,how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [30]:
df = pd.DataFrame(np.random.randn(7,3))

In [31]:
df

          0         1         2
0 -1.125260 -0.878391 -1.054530
1  1.341842  1.505979 -0.323011
2 -0.209385 -0.033615  2.456010
3 -2.367776  0.004654  1.720885
4 -1.103937 -0.112629 -0.224886
5 -2.036118 -1.434040  0.547603
6  0.068667  0.457207 -0.121502

In [32]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -1.125260       NaN       NaN
1  1.341842       NaN       NaN
2 -0.209385       NaN  2.456010
3 -2.367776       NaN  1.720885
4 -1.103937 -0.112629 -0.224886
5 -2.036118 -1.434040  0.547603
6  0.068667  0.457207 -0.121502

In [33]:
df.dropna

<bound method DataFrame.dropna of           0         1         2
0 -1.125260       NaN       NaN
1  1.341842       NaN       NaN
2 -0.209385       NaN  2.456010
3 -2.367776       NaN  1.720885
4 -1.103937 -0.112629 -0.224886
5 -2.036118 -1.434040  0.547603
6  0.068667  0.457207 -0.121502>

In [34]:
df.dropna(tresh = 2)

TypeError: dropna() got an unexpected keyword argument 'tresh'

In [35]:
df.dropna(thresh =2)

          0         1         2
2 -0.209385       NaN  2.456010
3 -2.367776       NaN  1.720885
4 -1.103937 -0.112629 -0.224886
5 -2.036118 -1.434040  0.547603
6  0.068667  0.457207 -0.121502

In [36]:
df

          0         1         2
0 -1.125260       NaN       NaN
1  1.341842       NaN       NaN
2 -0.209385       NaN  2.456010
3 -2.367776       NaN  1.720885
4 -1.103937 -0.112629 -0.224886
5 -2.036118 -1.434040  0.547603
6  0.068667  0.457207 -0.121502

In [37]:
df.fillna(0)

          0         1         2
0 -1.125260  0.000000  0.000000
1  1.341842  0.000000  0.000000
2 -0.209385  0.000000  2.456010
3 -2.367776  0.000000  1.720885
4 -1.103937 -0.112629 -0.224886
5 -2.036118 -1.434040  0.547603
6  0.068667  0.457207 -0.121502

In [38]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.125260  0.500000  0.000000
1  1.341842  0.500000  0.000000
2 -0.209385  0.500000  2.456010
3 -2.367776  0.500000  1.720885
4 -1.103937 -0.112629 -0.224886
5 -2.036118 -1.434040  0.547603
6  0.068667  0.457207 -0.121502

In [40]:
#使用inplace = True，表示存在对象被修改了
df.fillna(0,inplace= True)

In [41]:
df

          0         1         2
0 -1.125260  0.000000  0.000000
1  1.341842  0.000000  0.000000
2 -0.209385  0.000000  2.456010
3 -2.367776  0.000000  1.720885
4 -1.103937 -0.112629 -0.224886
5 -2.036118 -1.434040  0.547603
6  0.068667  0.457207 -0.121502

In [42]:
df =pd.DataFrame(np.random.randn(6,3))

In [43]:
df

          0         1         2
0 -2.126069  0.554965 -0.942931
1  0.710517 -0.179366  0.475176
2  1.845035  0.420201  0.128269
3 -0.131836  0.045634 -0.516765
4 -1.110265  0.771363  0.101848
5 -0.341887 -2.130620  0.075601

In [44]:
df.iloc[2:,1] = NA

In [45]:
df.iloc[4:,2] = NA

In [46]:
df

          0         1         2
0 -2.126069  0.554965 -0.942931
1  0.710517 -0.179366  0.475176
2  1.845035       NaN  0.128269
3 -0.131836       NaN -0.516765
4 -1.110265       NaN       NaN
5 -0.341887       NaN       NaN

In [47]:
df.fillna(method = 'ffill')

          0         1         2
0 -2.126069  0.554965 -0.942931
1  0.710517 -0.179366  0.475176
2  1.845035 -0.179366  0.128269
3 -0.131836 -0.179366 -0.516765
4 -1.110265 -0.179366 -0.516765
5 -0.341887 -0.179366 -0.516765

In [48]:
df.fillna(method = 'ffill',limit = 2)

          0         1         2
0 -2.126069  0.554965 -0.942931
1  0.710517 -0.179366  0.475176
2  1.845035 -0.179366  0.128269
3 -0.131836 -0.179366 -0.516765
4 -1.110265       NaN -0.516765
5 -0.341887       NaN -0.516765

In [49]:
#数据转换
data = pd.DataFrame({k1''one','two']*3 + ['two'],k2:[1,1,2,3,3,4,4]})
data

NameError: name 'k1' is not defined

In [53]:
#数据转换
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [54]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [55]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [56]:
data['v1'] = range(7)

In [57]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [58]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [59]:
data.drop_duplicates(['k1','k2'],keep = 'last') #保留最后一个参数

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [60]:
data = pd.DataFrame({
    'food':['bacon','pulled pork','bacon','Padstrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
    'ounces':[4,3,12,6,7.5,8,3,5,6]
    
})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3    Padstrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [61]:
meat_to_animal = {
    
    'bacon':'pig',
    'pulledpork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon',
}

In [62]:
lowercased = data['food'].str.lower()

In [63]:
lowercased

0          bacon
1    pulled pork
2          bacon
3      padstrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [64]:
data['food'][3] = 'pastrami'

D:\software\python\anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.